cpu
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 8, 26, 26]              72
              ReLU-2            [-1, 8, 26, 26]               0
       BatchNorm2d-3            [-1, 8, 26, 26]              16
           Dropout-4            [-1, 8, 26, 26]               0
            Conv2d-5           [-1, 16, 24, 24]           1,152
              ReLU-6           [-1, 16, 24, 24]               0
       BatchNorm2d-7           [-1, 16, 24, 24]              32
           Dropout-8           [-1, 16, 24, 24]               0
            Conv2d-9           [-1, 10, 24, 24]             160
        MaxPool2d-10           [-1, 10, 12, 12]               0
           Conv2d-11           [-1, 16, 10, 10]           1,440
             ReLU-12           [-1, 16, 10, 10]               0
      BatchNorm2d-13           [-1, 16, 10, 10]              32
          Dropout-14           [-1, 16, 10, 10]               0
           Conv2d-15             [-1, 16, 8, 8]           2,304
             ReLU-16             [-1, 16, 8, 8]               0
      BatchNorm2d-17             [-1, 16, 8, 8]              32
          Dropout-18             [-1, 16, 8, 8]               0
           Conv2d-19             [-1, 10, 6, 6]           1,440
             ReLU-20             [-1, 10, 6, 6]               0
      BatchNorm2d-21             [-1, 10, 6, 6]              20
          Dropout-22             [-1, 10, 6, 6]               0
           Conv2d-23             [-1, 10, 6, 6]             900
             ReLU-24             [-1, 10, 6, 6]               0
      BatchNorm2d-25             [-1, 10, 6, 6]              20
          Dropout-26             [-1, 10, 6, 6]               0
        MaxPool2d-27             [-1, 10, 3, 3]               0
        AvgPool2d-28             [-1, 10, 1, 1]               0
           Conv2d-29             [-1, 10, 1, 1]             100
================================================================
Total params: 7,720
Trainable params: 7,720
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.60
Params size (MB): 0.03
Estimated Total Size (MB): 0.64
----------------------------------------------------------------
